app/Modules/Users/Controllers/Users.php

  public function index()
  {
    $data = [
      'title'       => 'Data Users',
      'data_user'  => $this->users->findAll(),
    ];
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

      'level'         => $this->request->getPost('level'),
    ];

    $this->users->insert($data);
---
INSERT INTO `users` (`username`, `password`, `nama`, `jenis_kelamin`, `alamat`, `no_telepon`, `foto`, `level`, `created_at`, `updated_at`) VALUES ('admin', '25f9e794323b453885f5181f1b624d0b', 'Kipliii', 'Pria', 'dwqdwq', '7865', '1710647601_26f8418c1a1255fcb7ed.png', 'Customer', '2024-03-17 03:53:21', '2024-03-17 03:53:21')

  public function trash()
  {
    $data = [
      'title' => 'Data Trash Users',
      'data_user' => $this->users->onlyDeleted()->findAll()
    ];
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NOT NULL