app/Modules/Jenis/Controllers/Jenis.php

SELECT *
FROM `jenis`
WHERE `jenis`.`deleted_at` IS NULL
---
  public function index()
  {
    $data = [
      'title'       => 'Data Jenis Laundry',
      'data_jenis'  => $this->jenis->findAll(),

SELECT *
FROM `jenis`
WHERE `id_jenis` = '5'
AND `jenis`.`deleted_at` IS NULL
 LIMIT 1
---
  public function edit($id = null)
  {
    $jenis = $this->jenis->where('id_jenis', $id)->first();

SELECT *
FROM `jenis`
WHERE `jenis`.`deleted_at` IS NULL
AND `jenis`.`id_jenis` = '12'
UPDATE `jenis` SET `deleted_at` = '2024-03-15 07:59:00', `updated_at` = '2024-03-15 07:59:00'
WHERE `id_jenis` IN ('3')
AND `deleted_at` IS NULL
---
  public function delete()
  {
    if ($this->request->isAJAX()) {
      $id_jenis = $this->request->getVar('id_jenis');
      $jenis = $this->jenis->find($id_jenis);
      $this->jenis->where('id_jenis', $id_jenis)->delete();

SELECT *
FROM `jenis`
WHERE `jenis`.`deleted_at` IS NOT NULL
---
  public function trash()
  {
    $data = [
      'title' => 'Data Trash Jenis Laundry',
      'data_jenis' => $this->jenis->onlyDeleted()->findAll()
    ];

UPDATE `jenis` SET `deleted_at` = NULL
WHERE `id_jenis` = '12'
---
  public function delete2($id = null)
  {
    if ($id != null) {
      $this->jenis->delete($id, true);