app/Modules/Settings/Controllers/Settings.php

SELECT *
FROM `users`
WHERE `id_user` = '3'
---
  public function profile()
  {
    $data = [
      'title'     => 'Profile',
      'data_user' => $this->users->where('id_user', session('id_user'))->get()->getRow()
    ];