app/Modules/Auth/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `password` = '21232f297a57a5a743894a0e4a801fc3'
---
  public function authLogin()
  {
    $post   = $this->request->getPost();
    $query  = $this->users->getWhere([
      'username' => $post['username'],
      'password' => md5($post['password'])
    ]);