app/Modules/Pengeluaran/Controllers/Pengeluaran.php

SELECT *
FROM `pengeluaran`
WHERE `pengeluaran`.`deleted_at` IS NULL
---
  public function index()
  {
    $data = [
      'title'       => 'Pengeluaran',
      'data_pengeluaran'  => $this->pengeluaran->findAll(),

SELECT *
FROM `pengeluaran`
WHERE `pengeluaran`.`deleted_at` IS NOT NULL
---
  public function trash()
  {
    $data = [
      'title' => 'Data Trash Pengeluaran',
      'data_pengeluaran' => $this->pengeluaran->onlyDeleted()->findAll()