app/Helpers/custom_helper.php

SELECT *
FROM `users`
WHERE `id_user` = '3'
---
function userLogin()
{
  $db = \Config\Database::connect();
  return $db->table('users')->where('id_user', session('id_user'))->get()->getRow();